//Задача 24: Напишите программу, которая 
//принимает на вход число (А) и выдаёт сумму чисел 
//от 1 до А.

//7 -> 28
//4 -> 10
//8 -> 36

//Решение через цикл for.

int A = Convert.ToInt32(Console.ReadLine()); //Получена правая граница [1;A]
int sum = 0; // Сумма чисел, изначально равна 0.

// for (начало; условие; увеличение счётчика)
for (int i = 1; i <= A; i++)
//i = 1; A = 3; sum = 0
//Цикл:
//sum = sum + i (sum = 0 + 1)
//i++ (i + 1 = 2)

//sum = 1 + 2 (sum = 3)
//i++ (2 + 1 = 3)
//Итого:
//sum = 3 + 3 = 6
//i++
//i <= A (i=4, A = 3 => F A L S E)
//[1;3] = 3 + 2 + 1 = 6
{
    sum += i; // Сокращённая операция: sum = sum + i
}
System.Console.WriteLine($"Сумма чисел от 1 до {A} = {sum}");